Revit 2027 API
EnergyDataSettings.CheckRangeOfSillHeight Method
Note: This API is now obsolete.
 Checks that the sill height is greater than or equal to zero.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
public static bool CheckRangeOfSillHeight(
	double sillHeight
)
<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>
Public Shared Function CheckRangeOfSillHeight (
	sillHeight As Double
) As Boolean
public:
[ObsoleteAttribute(L"Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
static bool CheckRangeOfSillHeight(
	double sillHeight
)
[<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>]
static member CheckRangeOfSillHeight :
        sillHeight : float -> bool
Parameters
sillHeight Double
 The sill height to be checked.
Return Value
Boolean
 True if the sill height falls is greater than or equal to zero, false otherwise.
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace